Revit 2027 API
FieldBuilder.Ready Method
 Checks whether the builder may be used.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Ready()
Public Function Ready As Boolean
public:
bool Ready()
member Ready : unit -> bool
Return Value
Boolean
 True if the SchemaBuilder has not yet been finished.
Remarks
 All newly constructed FieldBuilders are usable until the call to the Finish method of the constructing SchemaBuilder.
See Also
Reference
FieldBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace